% ITU推荐的频段大气衰减计算，Ref: https://www.itu.int/rec/R-REC-P.676-7-200702-S/en
% 本程序适用频段为120GHz至350GHz
% 结果gamma0单位为dB/km，输入频率f单位为Hz，计算时换算为GHz
% 考虑温度为15摄氏度，气压为1atm，环境气体为干燥空气+水气（水汽密度7.5g/m^3）

function gamma = MoleAbs(f)
    f = f / 1e9;

    gamma_o = (3.02e-4/(1+1.9e-5*f^1.5)+0.283/((f-118.75)^2+2.91))*f^2*1e-3 - 0.00306; 
    
    n1 = 0.955 + 0.006*7.5;
    n2 = 0.735 + 0.0353*7.5;   
    gamma_w = (3.98*n1*g(f,22)/((f-22.235)^2 + 9.42*n1^2) + 11.96*n1/((f-183.31)^2 + 11.14*n1^2)+...
               0.081*n1/((f-321.226)^2+6.29*n1^2) + 3.66*n1/((f-235.153)^2+9.22*n1^2) + ...
               25.37*n1/(f-380)^2 + 17.4*n1/(f-448)^2 +844.6*n1*g(f,557)/(f-557)^2 + ...
               290*n1*g(f,752)/(f-752)^2 + 8.3328e4*n2*g(f,1780)/(f-1780)^2) * f^2 * 7.5e-4;
    
    gamma = gamma_o + gamma_w;
   
end

function r = g(a,b)
    r = 1+(a-b)^2/(a+b)^2;
end